In [9]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [10]:
%sql mysql+pymysql://root:SecureP%40sw0rd%21123@localhost:3306/company_data

In [11]:
%%sql
SELECT
	*
FROM
	Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('E001', 'Carmel', 'J01', 'Chef', 26, 'Cape Town'),
 ('E001', 'Carmel', 'J02', 'Waiter', 26, 'Cape Town'),
 ('E002', 'Stefanie', 'J02', 'Waiter', 56, 'Joburg'),
 ('E002', 'Stefanie', 'J03', 'Bartender', 56, 'Joburg'),
 ('E003', 'Lisa', 'J01', 'Chef', 5, 'Nairobi')]

In [21]:
%%sql 

create table if not exists Employees (
    Employee_id int primary key, 
    Name varchar(255), 
    State_code tinyint, 
    Home_state varchar(255)
);

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.

[]

In [23]:
%%sql

alter table Employees modify Employee_id varchar(255);

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.

[]

In [24]:
%%sql

insert into Employees (Employee_id, Name, State_code, Home_state)
Select distinct Employee_id, Name, State_code, Home_state
from Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
3 rows affected.

[]

In [25]:
%%sql 

select * from Employees

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
3 rows affected.

[('E001', 'Carmel', 26, 'Cape Town'),
 ('E002', 'Stefanie', 56, 'Joburg'),
 ('E003', 'Lisa', 5, 'Nairobi')]

In [27]:
%%sql 

create table Jobs (
    Job_code varchar(33),
    Job_title varchar(33),
    Employee_id varchar(255),
    primary key (Employee_id, Job_code)
);

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.

[]

In [28]:
%%sql

insert into Jobs (Employee_id, Job_code, Job_title)
select Employee_id, Job_code, Job_title
from Company_employees

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[]

In [29]:
%%sql

select * from Jobs

 * mysql+pymysql://root:***@localhost:3306/company_data
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('J01', 'Chef', 'E001'),
 ('J02', 'Waiter', 'E001'),
 ('J02', 'Waiter', 'E002'),
 ('J03', 'Bartender', 'E002'),
 ('J01', 'Chef', 'E003')]